nationalParks/app/views/parks/show.html.haml

  - @microposts.each do |post|
   - username = User.find(post.user).email.split("@")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1