nationalParks/app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts"
---
  def index
    @microposts = Micropost.all

INSERT INTO "microposts" ("content", "created_at", "park_id", "tag", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @micropost = Micropost.new(micropost_params)
    respond_to do |format|
      if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_micropost
      @micropost = Micropost.find(params[:id])