nationalParks/app/controllers/parks_controller.rb

  def index
    @parks = Park.all
---
SELECT "parks".* FROM "parks"

  def show
    if(params[:name] != nil)
      @park = find_by_name(params[:name])
    end
    session[:last_park] = @park.id
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."park_id" = 2

    def set_park
      @park = Park.find(params[:id])
---
SELECT "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT 1  [["id", "1"]]